app/admin/employees.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "salaries".* FROM "salaries" WHERE "salaries"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "leavetypes".* FROM "leavetypes" WHERE "leavetypes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    column :contact
    column :address
    column :department_id do |obj|
         Department.find(obj.department_id).department_name
    end
    column :salary_id do |obj|
      Salary.find(obj.salary_id).amount
    end
    column :leavetype_id do |obj|
      Leavetype.find(obj.leavetype_id).name

SELECT "departments".* FROM "departments" WHERE "departments"."department_name" != ?  [["department_name", "admin"]]
SELECT "leavetypes".* FROM "leavetypes" WHERE "leavetypes"."name" != ?  [["name", "admin"]]
SELECT "salaries".* FROM "salaries" WHERE "salaries"."position" != ?  [["position", "admin"]]
---
      f.input :password
      f.input :contact
      f.input :address
      f.input :department, as: :select, collection: Department.where.not(department_name: 'admin').map{ |a| [a.department_name, a.id] }
      f.input :leavetype, as: :select, collection: Leavetype.where.not(name: 'admin').map{ |a| [a.name, a.id] }
      f.input :salary, as: :select, collection: Salary.where.not(position: 'admin').map{ |a| [a.position, a.id] }