app/controllers/departments_controller.rb

  def show
    @department = Department.find_by(id: params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create

    @department = Department.new(depart_params)
    if @department.save
---
INSERT INTO "departments" ("department_name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["department_name", "frontend devloper"], ["created_at", "2023-11-06 07:36:16.503247"], ["updated_at", "2023-11-06 07:36:16.503247"]]

  def update
    @department = Department.find_by(id: params[:id])
    if @department.update(depart_params)
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "departments" SET "department_name" = ?, "updated_at" = ? WHERE "departments"."id" = ?  [["department_name", "junior"], ["updated_at", "2023-11-06 09:47:05.628556"], ["id", 1]]

  def destroy
    @department = Department.find_by(id: params[:id])
    if @department
      @department.destroy
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "departments" WHERE "departments"."id" = ?  [["id", 5]]