app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @employee = Employee.find_by(id: params[:id])

INSERT INTO "employees" ("name", "email", "password", "contact", "address", "department_id", "leavetype_id", "salary_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create

    @employee = Employee.new(employee_params)
    if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "contact" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["contact", "678987678"], ["updated_at", "2023-11-07 04:53:58.435074"], ["id", 1]]
---
  def update
    @employee = Employee.find_by(id: params[:id])
    if @employee.update(employee_params)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 2]]
---
  def destroy
    @employee = Employee.find_by(id: params[:id])
    if @employee
      @employee.destroy