app/controllers/leavetypes_controller.rb

SELECT "leavetypes".* FROM "leavetypes"
---
  def index
    @leavetypes = Leavetype.all

SELECT "leavetypes".* FROM "leavetypes" WHERE "leavetypes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @leavetype = Leavetype.find_by(id: params[:id])

INSERT INTO "leavetypes" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "sick leave"], ["created_at", "2023-11-06 10:13:14.511894"], ["updated_at", "2023-11-06 10:13:14.511894"]]
---
  def create

    @leavetype = Leavetype.new(leavetype_params)
    if @leavetype.save

SELECT "leavetypes".* FROM "leavetypes" WHERE "leavetypes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "leavetypes" SET "name" = ?, "updated_at" = ? WHERE "leavetypes"."id" = ?  [["name", "summer leave"], ["updated_at", "2023-11-06 10:15:16.337991"], ["id", 1]]
---
  def update
    @leavetype = Leavetype.find_by(id: params[:id])
    if @leavetype.update(leavetype_params)

SELECT "leavetypes".* FROM "leavetypes" WHERE "leavetypes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "leavetypes" WHERE "leavetypes"."id" = ?  [["id", 3]]
---
  def destroy
    @leavetype = Leavetype.find_by(id: params[:id])
    if @leavetype
      @leavetype.destroy