app/controllers/salaries_controller.rb

SELECT "salaries".* FROM "salaries"
---
  def index
    @salaries = Salary.all

SELECT "salaries".* FROM "salaries" WHERE "salaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @salary = Salary.find_by(id: params[:id])

INSERT INTO "salaries" ("amount", "created_at", "updated_at", "position") VALUES (?, ?, ?, ?) RETURNING "id"  [["amount", 20000.0], ["created_at", "2023-11-08 07:22:00.683946"], ["updated_at", "2023-11-08 07:22:00.683946"], ["position", "salary label"]]
---
  def create

    @salary = Salary.new(salary_params)
    if @salary.save

SELECT "salaries".* FROM "salaries" WHERE "salaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "salaries" SET "amount" = ?, "updated_at" = ? WHERE "salaries"."id" = ?  [["amount", 90000.0], ["updated_at", "2023-11-06 11:40:25.420630"], ["id", 1]]
---
  def update
    @salary = Salary.find_by(id: params[:id])
    if @salary.update(salary_params)

SELECT "salaries".* FROM "salaries" WHERE "salaries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "salaries" WHERE "salaries"."id" = ?  [["id", 4]]
---
  def destroy
    @salary = Salary.find_by(id: params[:id])
    if @salary
      @salary.destroy